In [1]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: numpy>=1.21.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [16]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [9]:
obj=pd.Series([1,2,3,4,-5])
obj

0    1
1    2
2    3
3    4
4   -5
dtype: int64

In [11]:
obj.values

array([ 1,  2,  3,  4, -5], dtype=int64)

In [12]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
obj[3]

4

In [17]:
labels = ['Z','b','c']

my_list = [10,20,30]

arr = np.array([10,20,30])

d = {'a':10,'b':20,'c':30}

In [18]:
a = pd.Series(data=my_list)
print(a)

0    10
1    20
2    30
dtype: int64

In [19]:
type(a)

pandas.core.series.Series

In [20]:
a=pd.Series(data=my_list,index=labels)

print(a)

Z    10
b    20
c    30
dtype: int64

In [22]:
a=pd.Series(my_list,labels)
print(a)

Z    10
b    20
c    30
dtype: int64

In [24]:
a["b"]

20

In [25]:
type(a)

pandas.core.series.Series

In [26]:
type(arr)

numpy.ndarray

In [27]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [29]:
pd.Series(arr,labels)

Z    10
b    20
c    30
dtype: int32

In [30]:
d

{'a': 10, 'b': 20, 'c': 30}

In [38]:
a=pd.Series(d)
a

a    10
b    20
c    30
dtype: int64

In [39]:
a["a"]

10

In [40]:
a.values

array([10, 20, 30], dtype=int64)

In [43]:
a.index

Index(['a', 'b', 'c'], dtype='object')

In [45]:
a["b"]=40

In [46]:
a

a    10
b    40
c    30
dtype: int64

In [48]:
new_series=pd.Series([sum,print,len],index=labels)
new_series

Z      <built-in function sum>
b    <built-in function print>
c      <built-in function len>
dtype: object

In [52]:
new_series["Z"]

In [53]:
ser1 = pd.Series(data=[1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [54]:
ser2 = pd.Series([1,2,3,4],index = ['USA', 'Germany','Italy', 'Japan']) 
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [55]:
ser1["USSR"]

3

In [57]:
ser2["Japan"]

4

In [58]:
print(ser1+ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [59]:
ser2*2

USA        2
Germany    4
Italy      6
Japan      8
dtype: int64

In [61]:
ser1[ser1>2]

USSR     3
Japan    4
dtype: int64

In [63]:
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]

auth_series = pd.Series(author)
article_series = pd.Series(article)

frame = { 'Author_Name_': auth_series, 'Article_Name_': article_series }

In [64]:
frame

{'Author_Name_': 0    Jitender
 1     Purnima
 2       Arpit
 3       Jyoti
 dtype: object,
 'Article_Name_': 0    210
 1    211
 2    114
 3    178
 dtype: int64}

In [66]:
result_df=pd.DataFrame(frame)
type(result_df["Author_Name_"])

pandas.core.series.Series

In [67]:
result_df.head()

  Author_Name_  Article_Name_
0     Jitender            210
1      Purnima            211
2        Arpit            114
3        Jyoti            178

In [ ]:
#read an excel file
import pandas as pd


salary_df=pd.read_csv("salaries.csv")
print(salary_df.to_string())
type(salary_df)

In [71]:
salary_df.shape

(148654, 13)

In [5]:
salary_df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [73]:
salary_df.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.0,0.0,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [75]:
salary_df2=pd.read_csv("salaries.csv",usecols=["Id","EmployeeName","JobTitle","BasePay"],nrows=10000,skiprows=range(1,100))
salary_df2.shape

(10000, 4)

In [76]:
salary_df2.head()

,Id,EmployeeName,JobTitle,BasePay
0,100,SONALI BOSE,DEPUTY DIRECTOR II - MUNICIPAL TRANSPORTATION AG,224035.85
1,101,KEVIN TAYLOR,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.65
2,102,ERIKA HOO,"LIEUTENANT, FIRE DEPARTMENT",123105.00
3,103,LAUIFI SEUMAALA,FIREFIGHTER,105934.69
4,104,EDWARD DENNIS,TRANSIT SUPERVISOR,88400.70

In [78]:
salary_df_2=pd.read_csv("salaries.csv",usecols=["EmployeeName","JobTitle","BasePay"],nrows=100,skiprows=[1])
salary_df2.shape

(10000, 4)

In [79]:
salary_df_2

,EmployeeName,JobTitle,BasePay
0,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02
1,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13
2,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00
3,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60
4,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00
...,...,...,...
95,SARAH CARY,ANESTHETIST,208925.60
96,KEVIN SMITH,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.67
97,GREGORY STANGLAND,FIRE FIGHTER PARAMEDIC,122404.98
98,SONALI BOSE,DEPUTY DIRECTOR II - MUNICIPAL TRANSPORTATION AG,224035.85
99,KEVIN TAYLOR,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.65

In [80]:
salary_df_2.head(8)

        EmployeeName                                      JobTitle    BasePay
0       GARY JIMENEZ               CAPTAIN III (POLICE DEPARTMENT)  155966.02
1     ALBERT PARDINI               CAPTAIN III (POLICE DEPARTMENT)  212739.13
2  CHRISTOPHER CHONG          WIRE ROPE CABLE MAINTENANCE MECHANIC   77916.00
3    PATRICK GARDNER  DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)  134401.60
4     DAVID SULLIVAN                     ASSISTANT DEPUTY CHIEF II  118602.00
5          ALSON LEE            BATTALION CHIEF, (FIRE DEPARTMENT)   92492.01
6      DAVID KUSHNER                DEPUTY DIRECTOR OF INVESTMENTS  256576.96
7     MICHAEL MORRIS            BATTALION CHIEF, (FIRE DEPARTMENT)  176932.64

In [81]:
salary_df_2.tail(11)

,EmployeeName,JobTitle,BasePay
89,MARK GONZALES,"BATTALION CHIEF, (FIRE DEPARTMENT)",188842.37
90,DONNA MEIXNER,CAPTAIN III (POLICE DEPARTMENT),102722.40
91,PETE FAY JR,"CAPTAIN, FIRE SUPPRESSION",149362.84
92,JOHN MURPHY,CAPTAIN III (POLICE DEPARTMENT),215914.03
93,REX HALE,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.62
94,MIVIC HIROSE,MANAGER VIII,215180.76
95,SARAH CARY,ANESTHETIST,208925.60
96,KEVIN SMITH,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.67
97,GREGORY STANGLAND,FIRE FIGHTER PARAMEDIC,122404.98
98,SONALI BOSE,DEPUTY DIRECTOR II - MUNICIPAL TRANSPORTATION AG,224035.85
99,KEVIN TAYLOR,"BATTALION CHIEF, (FIRE DEPARTMENT)",168692.65

In [82]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [83]:
salary_df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [84]:
salary_df.describe(include="object")

       EmployeeName          JobTitle         Agency
count        148654            148654         148654
unique       110811              2159              1
top       Kevin Lee  Transit Operator  San Francisco
freq             13              7036         148654

In [85]:
salary_df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [86]:
salary_df.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [87]:
salary_df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [88]:
salary_df["JobTitle"].shape

(148654,)

In [89]:
salary_df["JobTitle"].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [90]:
salary_df["JobTitle"].nunique()

2159

In [94]:
salary_df["JobTitle"].value_counts()

Transit Operator                                  7036
Special Nurse                                     4389
Registered Nurse                                  3736
Public Svc Aide-Public Works                      2518
Police Officer 3                                  2421
                                                  ...
CHIEF HOUSING INSPECTOR                              1
TRAFFIC SIGNAL OPERATOR                              1
COURT COMPUTER FACILITIES COORDINATOR                1
AUTOMOTIVE BODY AND FENDER WORKER SUPERVISOR I       1
VICTIM & WITNESS TECHNICIAN                          1
Name: JobTitle, Length: 2159, dtype: int64

In [95]:
salary_df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [6]:
salary_df["JobTitle"].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [7]:
salary_df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448840,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

In [8]:
salary_df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64